FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_gmac.h
/* ---------------------------------------------------------------------------- */
/*                  Atmel Microcontroller Software Support                      */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2014, Atmel Corporation                                        */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Atmel's name may not be used to endorse or promote products derived from     */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   */
/* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF */
/* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   */
/* DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      */
/* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT */
/* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  */
/* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    */
/* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         */
/* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, */
/* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           */
/* ---------------------------------------------------------------------------- */

#ifndef _SAM_GMAC_COMPONENT_
#define _SAM_GMAC_COMPONENT_

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR Gigabit Ethernet MAC */
/* ============================================================================= */
/** \addtogroup SAM_GMAC Gigabit Ethernet MAC */
/*@{*/

#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
/** \brief GmacSa hardware registers */
    typedef struct
    {
        __IO uint32_t GMAC_SAB; /**< \brief (GmacSa Offset: 0x0) Specific Address 1 Bottom [31:0] Register */
        __IO uint32_t GMAC_SAT; /**< \brief (GmacSa Offset: 0x4) Specific Address 1 Top [47:32] Register */
    } GmacSa;
/** \brief Gmac hardware registers */
    #define GMACSA_NUMBER    4
    typedef struct
    {
        __IO uint32_t GMAC_NCR;          /**< \brief (Gmac Offset: 0x000) Network Control Register */
        __IO uint32_t GMAC_NCFGR;        /**< \brief (Gmac Offset: 0x004) Network Configuration Register */
        __I uint32_t GMAC_NSR;           /**< \brief (Gmac Offset: 0x008) Network Status Register */
        __IO uint32_t GMAC_UR;           /**< \brief (Gmac Offset: 0x00C) User Register */
        __IO uint32_t GMAC_DCFGR;        /**< \brief (Gmac Offset: 0x010) DMA Configuration Register */
        __IO uint32_t GMAC_TSR;          /**< \brief (Gmac Offset: 0x014) Transmit Status Register */
        __IO uint32_t GMAC_RBQB;         /**< \brief (Gmac Offset: 0x018) Receive Buffer Queue Base Address */
        __IO uint32_t GMAC_TBQB;         /**< \brief (Gmac Offset: 0x01C) Transmit Buffer Queue Base Address */
        __IO uint32_t GMAC_RSR;          /**< \brief (Gmac Offset: 0x020) Receive Status Register */
        __I uint32_t GMAC_ISR;           /**< \brief (Gmac Offset: 0x024) Interrupt Status Register */
        __O uint32_t GMAC_IER;           /**< \brief (Gmac Offset: 0x028) Interrupt Enable Register */
        __O uint32_t GMAC_IDR;           /**< \brief (Gmac Offset: 0x02C) Interrupt Disable Register */
        __I uint32_t GMAC_IMR;           /**< \brief (Gmac Offset: 0x030) Interrupt Mask Register */
        __IO uint32_t GMAC_MAN;          /**< \brief (Gmac Offset: 0x034) PHY Maintenance Register */
        __I uint32_t GMAC_RPQ;           /**< \brief (Gmac Offset: 0x038) Received Pause Quantum Register */
        __IO uint32_t GMAC_TPQ;          /**< \brief (Gmac Offset: 0x03C) Transmit Pause Quantum Register */
        __I uint32_t Reserved1[ 16 ];
        __IO uint32_t GMAC_HRB;          /**< \brief (Gmac Offset: 0x080) Hash Register Bottom [31:0] */
        __IO uint32_t GMAC_HRT;          /**< \brief (Gmac Offset: 0x084) Hash Register Top [63:32] */
        GmacSa GMAC_SA[ GMACSA_NUMBER ]; /**< \brief (Gmac Offset: 0x088) 1 .. 4 */
        __IO uint32_t GMAC_TIDM[ 4 ];    /**< \brief (Gmac Offset: 0x0A8) Type ID Match 1 Register */
        __IO uint32_t GMAC_WOL;          /**< \brief (Gmac Offset: 0x0B8) Wake on LAN Register */
        __IO uint32_t GMAC_IPGS;         /**< \brief (Gmac Offset: 0x0BC) IPG Stretch Register */
        __IO uint32_t GMAC_SVLAN;        /**< \brief (Gmac Offset: 0x0C0) Stacked VLAN Register */
        __IO uint32_t GMAC_TPFCP;        /**< \brief (Gmac Offset: 0x0C4) Transmit PFC Pause Register */
        __IO uint32_t GMAC_SAMB1;        /**< \brief (Gmac Offset: 0x0C8) Specific Address 1 Mask Bottom [31:0] Register */
        __IO uint32_t GMAC_SAMT1;        /**< \brief (Gmac Offset: 0x0CC) Specific Address 1 Mask Top [47:32] Register */
        __I uint32_t Reserved2[ 11 ];
        __I uint32_t GMAC_MID;           /**< \brief (Gmac Offset: 0x0FC) Module ID Register */
        __I uint32_t GMAC_OTLO;          /**< \brief (Gmac Offset: 0x100) Octets Transmitted [31:0] Register */
        __I uint32_t GMAC_OTHI;          /**< \brief (Gmac Offset: 0x104) Octets Transmitted [47:32] Register */
        __I uint32_t GMAC_FT;            /**< \brief (Gmac Offset: 0x108) Frames Transmitted Register */
        __I uint32_t GMAC_BCFT;          /**< \brief (Gmac Offset: 0x10C) Broadcast Frames Transmitted Register */
        __I uint32_t GMAC_MFT;           /**< \brief (Gmac Offset: 0x110) Multicast Frames Transmitted Register */
        __I uint32_t GMAC_PFT;           /**< \brief (Gmac Offset: 0x114) Pause Frames Transmitted Register */
        __I uint32_t GMAC_BFT64;         /**< \brief (Gmac Offset: 0x118) 64 Byte Frames Transmitted Register */
        __I uint32_t GMAC_TBFT127;       /**< \brief (Gmac Offset: 0x11C) 65 to 127 Byte Frames Transmitted Register */
        __I uint32_t GMAC_TBFT255;       /**< \brief (Gmac Offset: 0x120) 128 to 255 Byte Frames Transmitted Register */
        __I uint32_t GMAC_TBFT511;       /**< \brief (Gmac Offset: 0x124) 256 to 511 Byte Frames Transmitted Register */
        __I uint32_t GMAC_TBFT1023;      /**< \brief (Gmac Offset: 0x128) 512 to 1023 Byte Frames Transmitted Register */
        __I uint32_t GMAC_TBFT1518;      /**< \brief (Gmac Offset: 0x12C) 1024 to 1518 Byte Frames Transmitted Register */
        __I uint32_t GMAC_GTBFT1518;     /**< \brief (Gmac Offset: 0x130) Greater Than 1518 Byte Frames Transmitted Register */
        __I uint32_t GMAC_TUR;           /**< \brief (Gmac Offset: 0x134) Transmit Under Runs Register */
        __I uint32_t GMAC_SCF;           /**< \brief (Gmac Offset: 0x138) Single Collision Frames Register */
        __I uint32_t GMAC_MCF;           /**< \brief (Gmac Offset: 0x13C) Multiple Collision Frames Register */
        __I uint32_t GMAC_EC;            /**< \brief (Gmac Offset: 0x140) Excessive Collisions Register */
        __I uint32_t GMAC_LC;            /**< \brief (Gmac Offset: 0x144) Late Collisions Register */
        __I uint32_t GMAC_DTF;           /**< \brief (Gmac Offset: 0x148) Deferred Transmission Frames Register */
        __I uint32_t GMAC_CSE;           /**< \brief (Gmac Offset: 0x14C) Carrier Sense Errors Register */
        __I uint32_t GMAC_ORLO;          /**< \brief (Gmac Offset: 0x150) Octets Received [31:0] Received */
        __I uint32_t GMAC_ORHI;          /**< \brief (Gmac Offset: 0x154) Octets Received [47:32] Received */
        __I uint32_t GMAC_FR;            /**< \brief (Gmac Offset: 0x158) Frames Received Register */
        __I uint32_t GMAC_BCFR;          /**< \brief (Gmac Offset: 0x15C) Broadcast Frames Received Register */
        __I uint32_t GMAC_MFR;           /**< \brief (Gmac Offset: 0x160) Multicast Frames Received Register */
        __I uint32_t GMAC_PFR;           /**< \brief (Gmac Offset: 0x164) Pause Frames Received Register */
        __I uint32_t GMAC_BFR64;         /**< \brief (Gmac Offset: 0x168) 64 Byte Frames Received Register */
        __I uint32_t GMAC_TBFR127;       /**< \brief (Gmac Offset: 0x16C) 65 to 127 Byte Frames Received Register */
        __I uint32_t GMAC_TBFR255;       /**< \brief (Gmac Offset: 0x170) 128 to 255 Byte Frames Received Register */
        __I uint32_t GMAC_TBFR511;       /**< \brief (Gmac Offset: 0x174) 256 to 511Byte Frames Received Register */
        __I uint32_t GMAC_TBFR1023;      /**< \brief (Gmac Offset: 0x178) 512 to 1023 Byte Frames Received Register */
        __I uint32_t GMAC_TBFR1518;      /**< \brief (Gmac Offset: 0x17C) 1024 to 1518 Byte Frames Received Register */
        __I uint32_t GMAC_TMXBFR;        /**< \brief (Gmac Offset: 0x180) 1519 to Maximum Byte Frames Received Register */
        __I uint32_t GMAC_UFR;           /**< \brief (Gmac Offset: 0x184) Undersize Frames Received Register */
        __I uint32_t GMAC_OFR;           /**< \brief (Gmac Offset: 0x188) Oversize Frames Received Register */
        __I uint32_t GMAC_JR;            /**< \brief (Gmac Offset: 0x18C) Jabbers Received Register */
        __I uint32_t GMAC_FCSE;          /**< \brief (Gmac Offset: 0x190) Frame Check Sequence Errors Register */
        __I uint32_t GMAC_LFFE;          /**< \brief (Gmac Offset: 0x194) Length Field Frame Errors Register */
        __I uint32_t GMAC_RSE;           /**< \brief (Gmac Offset: 0x198) Receive Symbol Errors Register */
        __I uint32_t GMAC_AE;            /**< \brief (Gmac Offset: 0x19C) Alignment Errors Register */
        __I uint32_t GMAC_RRE;           /**< \brief (Gmac Offset: 0x1A0) Receive Resource Errors Register */
        __I uint32_t GMAC_ROE;           /**< \brief (Gmac Offset: 0x1A4) Receive Overrun Register */
        __I uint32_t GMAC_IHCE;          /**< \brief (Gmac Offset: 0x1A8) IP Header Checksum Errors Register */
        __I uint32_t GMAC_TCE;           /**< \brief (Gmac Offset: 0x1AC) TCP Checksum Errors Register */
        __I uint32_t GMAC_UCE;           /**< \brief (Gmac Offset: 0x1B0) UDP Checksum Errors Register */
        __I uint32_t Reserved3[ 5 ];
        __IO uint32_t GMAC_TSSS;         /**< \brief (Gmac Offset: 0x1C8) 1588 Timer Sync Strobe Seconds Register */
        __IO uint32_t GMAC_TSSN;         /**< \brief (Gmac Offset: 0x1CC) 1588 Timer Sync Strobe Nanoseconds Register */
        __IO uint32_t GMAC_TS;           /**< \brief (Gmac Offset: 0x1D0) 1588 Timer Seconds Register */
        __IO uint32_t GMAC_TN;           /**< \brief (Gmac Offset: 0x1D4) 1588 Timer Nanoseconds Register */
        __O uint32_t GMAC_TA;            /**< \brief (Gmac Offset: 0x1D8) 1588 Timer Adjust Register */
        __IO uint32_t GMAC_TI;           /**< \brief (Gmac Offset: 0x1DC) 1588 Timer Increment Register */
        __I uint32_t GMAC_EFTS;          /**< \brief (Gmac Offset: 0x1E0) PTP Event Frame Transmitted Seconds */
        __I uint32_t GMAC_EFTN;          /**< \brief (Gmac Offset: 0x1E4) PTP Event Frame Transmitted Nanoseconds */
        __I uint32_t GMAC_EFRS;          /**< \brief (Gmac Offset: 0x1E8) PTP Event Frame Received Seconds */
        __I uint32_t GMAC_EFRN;          /**< \brief (Gmac Offset: 0x1EC) PTP Event Frame Received Nanoseconds */
        __I uint32_t GMAC_PEFTS;         /**< \brief (Gmac Offset: 0x1F0) PTP Peer Event Frame Transmitted Seconds */
        __I uint32_t GMAC_PEFTN;         /**< \brief (Gmac Offset: 0x1F4) PTP Peer Event Frame Transmitted Nanoseconds */
        __I uint32_t GMAC_PEFRS;         /**< \brief (Gmac Offset: 0x1F8) PTP Peer Event Frame Received Seconds */
        __I uint32_t GMAC_PEFRN;         /**< \brief (Gmac Offset: 0x1FC) PTP Peer Event Frame Received Nanoseconds */
        __I uint32_t Reserved4[ 128 ];
        __I uint32_t GMAC_ISRPQ[ 7 ];    /**< \brief (Gmac Offset: 0x400) Interrupt Status Register Priority Queue */
        __I uint32_t Reserved5[ 9 ];
        __IO uint32_t GMAC_TBQBAPQ[ 7 ]; /**< \brief (Gmac Offset: 0x440) Transmit Buffer Queue Base Address Priority Queue */
        __I uint32_t Reserved6[ 9 ];
        __IO uint32_t GMAC_RBQBAPQ[ 7 ]; /**< \brief (Gmac Offset: 0x480) Receive Buffer Queue Base Address Priority Queue */
        __I uint32_t Reserved7[ 1 ];
        __IO uint32_t GMAC_RBSRPQ[ 7 ];  /**< \brief (Gmac Offset: 0x4A0) Receive Buffer Size Register Priority Queue */
        __I uint32_t Reserved8[ 17 ];
        __IO uint32_t GMAC_ST1RPQ[ 16 ]; /**< \brief (Gmac Offset: 0x500) Screening Type 1 Register Priority Queue */
        __IO uint32_t GMAC_ST2RPQ[ 16 ]; /**< \brief (Gmac Offset: 0x540) Screening Type 2 Register Priority Queue */
        __I uint32_t Reserved9[ 32 ];
        __O uint32_t GMAC_IERPQ[ 7 ];    /**< \brief (Gmac Offset: 0x600) Interrupt Enable Register Priority Queue */
        __I uint32_t Reserved10[ 1 ];
        __O uint32_t GMAC_IDRPQ[ 7 ];    /**< \brief (Gmac Offset: 0x620) Interrupt Disable Register Priority Queue */
        __I uint32_t Reserved11[ 1 ];
        __IO uint32_t GMAC_IMRPQ[ 7 ];   /**< \brief (Gmac Offset: 0x640) Interrupt Mask Register Priority Queue */
    } Gmac;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
/* -------- GMAC_NCR : (GMAC Offset: 0x000) Network Control Register -------- */
#define GMAC_NCR_LBL                 ( 0x1u << 1 )                     /**< \brief (GMAC_NCR) Loop Back Local */
#define GMAC_NCR_RXEN                ( 0x1u << 2 )                     /**< \brief (GMAC_NCR) Receive Enable */
#define GMAC_NCR_TXEN                ( 0x1u << 3 )                     /**< \brief (GMAC_NCR) Transmit Enable */
#define GMAC_NCR_MPE                 ( 0x1u << 4 )                     /**< \brief (GMAC_NCR) Management Port Enable */
#define GMAC_NCR_CLRSTAT             ( 0x1u << 5 )                     /**< \brief (GMAC_NCR) Clear Statistics Registers */
#define GMAC_NCR_INCSTAT             ( 0x1u << 6 )                     /**< \brief (GMAC_NCR) Increment Statistics Registers */
#define GMAC_NCR_WESTAT              ( 0x1u << 7 )                     /**< \brief (GMAC_NCR) Write Enable for Statistics Registers */
#define GMAC_NCR_BP                  ( 0x1u << 8 )                     /**< \brief (GMAC_NCR) Back pressure */
#define GMAC_NCR_TSTART              ( 0x1u << 9 )                     /**< \brief (GMAC_NCR) Start Transmission */
#define GMAC_NCR_THALT               ( 0x1u << 10 )                    /**< \brief (GMAC_NCR) Transmit Halt */
#define GMAC_NCR_TXPF                ( 0x1u << 11 )                    /**< \brief (GMAC_NCR) Transmit Pause Frame */
#define GMAC_NCR_TXZQPF              ( 0x1u << 12 )                    /**< \brief (GMAC_NCR) Transmit Zero Quantum Pause Frame */
#define GMAC_NCR_SRTSM               ( 0x1u << 15 )                    /**< \brief (GMAC_NCR) Store Receive Time Stamp to Memory */
#define GMAC_NCR_ENPBPR              ( 0x1u << 16 )                    /**< \brief (GMAC_NCR) Enable PFC Priority-based Pause Reception */
#define GMAC_NCR_TXPBPF              ( 0x1u << 17 )                    /**< \brief (GMAC_NCR) Transmit PFC Priority-based Pause Frame */
#define GMAC_NCR_FNP                 ( 0x1u << 18 )                    /**< \brief (GMAC_NCR) Flush Next Packet */
/* -------- GMAC_NCFGR : (GMAC Offset: 0x004) Network Configuration Register -------- */
#define GMAC_NCFGR_SPD               ( 0x1u << 0 )                     /**< \brief (GMAC_NCFGR) Speed */
#define GMAC_NCFGR_FD                ( 0x1u << 1 )                     /**< \brief (GMAC_NCFGR) Full Duplex */
#define GMAC_NCFGR_DNVLAN            ( 0x1u << 2 )                     /**< \brief (GMAC_NCFGR) Discard Non-VLAN FRAMES */
#define GMAC_NCFGR_JFRAME            ( 0x1u << 3 )                     /**< \brief (GMAC_NCFGR) Jumbo Frame Size */
#define GMAC_NCFGR_CAF               ( 0x1u << 4 )                     /**< \brief (GMAC_NCFGR) Copy All Frames */
#define GMAC_NCFGR_NBC               ( 0x1u << 5 )                     /**< \brief (GMAC_NCFGR) No Broadcast */
#define GMAC_NCFGR_MTIHEN            ( 0x1u << 6 )                     /**< \brief (GMAC_NCFGR) Multicast Hash Enable */
#define GMAC_NCFGR_UNIHEN            ( 0x1u << 7 )                     /**< \brief (GMAC_NCFGR) Unicast Hash Enable */
#define GMAC_NCFGR_MAXFS             ( 0x1u << 8 )                     /**< \brief (GMAC_NCFGR) 1536 Maximum Frame Size */
#define GMAC_NCFGR_RTY               ( 0x1u << 12 )                    /**< \brief (GMAC_NCFGR) Retry Test */
#define GMAC_NCFGR_PEN               ( 0x1u << 13 )                    /**< \brief (GMAC_NCFGR) Pause Enable */
#define GMAC_NCFGR_RXBUFO_Pos        14
#define GMAC_NCFGR_RXBUFO_Msk        ( 0x3u << GMAC_NCFGR_RXBUFO_Pos ) /**< \brief (GMAC_NCFGR) Receive Buffer Offset */
#define GMAC_NCFGR_RXBUFO( value )    ( ( GMAC_NCFGR_RXBUFO_Msk & ( ( value ) << GMAC_NCFGR_RXBUFO_Pos ) ) )
#define GMAC_NCFGR_LFERD             ( 0x1u << 16 )                    /**< \brief (GMAC_NCFGR) Length Field Error Frame Discard */
#define GMAC_NCFGR_RFCS              ( 0x1u << 17 )                    /**< \brief (GMAC_NCFGR) Remove FCS */
#define GMAC_NCFGR_CLK_Pos           18
#define GMAC_NCFGR_CLK_Msk           ( 0x7u << GMAC_NCFGR_CLK_Pos )    /**< \brief (GMAC_NCFGR) MDC CLock Division */
#define   GMAC_NCFGR_CLK_MCK_8       ( 0x0u << 18 )                    /**< \brief (GMAC_NCFGR) MCK divided by 8 (MCK up to 20 MHz) */
#define   GMAC_NCFGR_CLK_MCK_16      ( 0x1u << 18 )                    /**< \brief (GMAC_NCFGR) MCK divided by 16 (MCK up to 40 MHz) */
#define   GMAC_NCFGR_CLK_MCK_32      ( 0x2u << 18 )                    /**< \brief (GMAC_NCFGR) MCK divided by 32 (MCK up to 80 MHz) */
#define   GMAC_NCFGR_CLK_MCK_48      ( 0x3u << 18 )                    /**< \brief (GMAC_NCFGR) MCK divided by 48 (MCK up to 120MHz) */
#define   GMAC_NCFGR_CLK_MCK_64      ( 0x4u << 18 )                    /**< \brief (GMAC_NCFGR) MCK divided by 64 (MCK up to 160 MHz) */
#define   GMAC_NCFGR_CLK_MCK_96      ( 0x5u << 18 )                    /**< \brief (GMAC_NCFGR) MCK divided by 96 (MCK up to 240 MHz) */
#define GMAC_NCFGR_DBW_Pos           21
#define GMAC_NCFGR_DBW_Msk           ( 0x3u << GMAC_NCFGR_DBW_Pos )    /**< \brief (GMAC_NCFGR) Data Bus Width */
#define GMAC_NCFGR_DBW( value )    ( ( GMAC_NCFGR_DBW_Msk & ( ( value ) << GMAC_NCFGR_DBW_Pos ) ) )
#define GMAC_NCFGR_DCPF              ( 0x1u << 23 )                    /**< \brief (GMAC_NCFGR) Disable Copy of Pause Frames */
#define GMAC_NCFGR_RXCOEN            ( 0x1u << 24 )                    /**< \brief (GMAC_NCFGR) Receive Checksum Offload Enable */
#define GMAC_NCFGR_EFRHD             ( 0x1u << 25 )                    /**< \brief (GMAC_NCFGR) Enable Frames Received in Half Duplex */
#define GMAC_NCFGR_IRXFCS            ( 0x1u << 26 )                    /**< \brief (GMAC_NCFGR) Ignore RX FCS */
#define GMAC_NCFGR_IPGSEN            ( 0x1u << 28 )                    /**< \brief (GMAC_NCFGR) IP Stretch Enable */
#define GMAC_NCFGR_RXBP              ( 0x1u << 29 )                    /**< \brief (GMAC_NCFGR) Receive Bad Preamble */
#define GMAC_NCFGR_IRXER             ( 0x1u << 30 )                    /**< \brief (GMAC_NCFGR) Ignore IPG GRXER */
/* -------- GMAC_NSR : (GMAC Offset: 0x008) Network Status Register -------- */
#define GMAC_NSR_MDIO                ( 0x1u << 1 )                     /**< \brief (GMAC_NSR) MDIO Input Status */
#define GMAC_NSR_IDLE                ( 0x1u << 2 )                     /**< \brief (GMAC_NSR) PHY Management Logic Idle */
/* -------- GMAC_UR : (GMAC Offset: 0x00C) User Register -------- */
#define GMAC_UR_RMIIMII              ( 0x1u << 0 )                     /**< \brief (GMAC_UR)  */
/* -------- GMAC_DCFGR : (GMAC Offset: 0x010) DMA Configuration Register -------- */
#define GMAC_DCFGR_FBLDO_Pos         0
#define GMAC_DCFGR_FBLDO_Msk         ( 0x1fu << GMAC_DCFGR_FBLDO_Pos ) /**< \brief (GMAC_DCFGR) Fixed Burst Length for DMA Data Operations: */
#define   GMAC_DCFGR_FBLDO_SINGLE    ( 0x1u << 0 )                     /**< \brief (GMAC_DCFGR) 00001: Always use SINGLE AHB bursts */
#define   GMAC_DCFGR_FBLDO_INCR4     ( 0x4u << 0 )                     /**< \brief (GMAC_DCFGR) 001xx: Attempt to use INCR4 AHB bursts (Default) */
#define   GMAC_DCFGR_FBLDO_INCR8     ( 0x8u << 0 )                     /**< \brief (GMAC_DCFGR) 01xxx: Attempt to use INCR8 AHB bursts */
#define   GMAC_DCFGR_FBLDO_INCR16    ( 0x10u << 0 )                    /**< \brief (GMAC_DCFGR) 1xxxx: Attempt to use INCR16 AHB bursts */
#define GMAC_DCFGR_ESMA              ( 0x1u << 6 )                     /**< \brief (GMAC_DCFGR) Endian Swap Mode Enable for Management Descriptor Accesses */
#define GMAC_DCFGR_ESPA              ( 0x1u << 7 )                     /**< \brief (GMAC_DCFGR) Endian Swap Mode Enable for Packet Data Accesses */
#define GMAC_DCFGR_TXCOEN            ( 0x1u << 11 )                    /**< \brief (GMAC_DCFGR) Transmitter Checksum Generation Offload Enable */
#define GMAC_DCFGR_DRBS_Pos          16
#define GMAC_DCFGR_DRBS_Msk          ( 0xffu << GMAC_DCFGR_DRBS_Pos )  /**< \brief (GMAC_DCFGR) DMA Receive Buffer Size */
#define GMAC_DCFGR_DRBS( value )    ( ( GMAC_DCFGR_DRBS_Msk & ( ( value ) << GMAC_DCFGR_DRBS_Pos ) ) )
/* -------- GMAC_TSR : (GMAC Offset: 0x014) Transmit Status Register -------- */
#define GMAC_TSR_UBR                 ( 0x1u << 0 ) /**< \brief (GMAC_TSR) Used Bit Read */
#define GMAC_TSR_COL                 ( 0x1u << 1 ) /**< \brief (GMAC_TSR) Collision Occurred */
#define GMAC_TSR_RLE                 ( 0x1u << 2 ) /**< \brief (GMAC_TSR) Retry Limit Exceeded */
#define GMAC_TSR_TXGO                ( 0x1u << 3 ) /**< \brief (GMAC_TSR) Transmit Go */
#define GMAC_TSR_TFC                 ( 0x1u << 4 ) /**< \brief (GMAC_TSR) Transmit Frame Corruption due to AHB error */
#define GMAC_TSR_TXCOMP              ( 0x1u << 5 ) /**< \brief (GMAC_TSR) Transmit Complete */
#define GMAC_TSR_UND                 ( 0x1u << 6 ) /**< \brief (GMAC_TSR) Transmit Under Run */
#define GMAC_TSR_HRESP               ( 0x1u << 8 ) /**< \brief (GMAC_TSR) HRESP Not OK */
/* -------- GMAC_RBQB : (GMAC Offset: 0x018) Receive Buffer Queue Base Address -------- */
#define GMAC_RBQB_ADDR_Pos           2
#define GMAC_RBQB_ADDR_Msk           ( 0x3fffffffu << GMAC_RBQB_ADDR_Pos ) /**< \brief (GMAC_RBQB) Receive buffer queue base address */
#define GMAC_RBQB_ADDR( value )    ( ( GMAC_RBQB_ADDR_Msk & ( ( value ) << GMAC_RBQB_ADDR_Pos ) ) )
/* -------- GMAC_TBQB : (GMAC Offset: 0x01C) Transmit Buffer Queue Base Address -------- */
#define GMAC_TBQB_ADDR_Pos           2
#define GMAC_TBQB_ADDR_Msk           ( 0x3fffffffu << GMAC_TBQB_ADDR_Pos ) /**< \brief (GMAC_TBQB) Transmit Buffer Queue Base Address */
#define GMAC_TBQB_ADDR( value )    ( ( GMAC_TBQB_ADDR_Msk & ( ( value ) << GMAC_TBQB_ADDR_Pos ) ) )
/* -------- GMAC_RSR : (GMAC Offset: 0x020) Receive Status Register -------- */
#define GMAC_RSR_BNA                 ( 0x1u << 0 )  /**< \brief (GMAC_RSR) Buffer Not Available */
