FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_gmac.h
#define GMAC_RSR_REC                 ( 0x1u << 1 )  /**< \brief (GMAC_RSR) Frame Received */
#define GMAC_RSR_RXOVR               ( 0x1u << 2 )  /**< \brief (GMAC_RSR) Receive Overrun */
#define GMAC_RSR_HNO                 ( 0x1u << 3 )  /**< \brief (GMAC_RSR) HRESP Not OK */
/* -------- GMAC_ISR : (GMAC Offset: 0x024) Interrupt Status Register -------- */
#define GMAC_ISR_MFS                 ( 0x1u << 0 )  /**< \brief (GMAC_ISR) Management Frame Sent */
#define GMAC_ISR_RCOMP               ( 0x1u << 1 )  /**< \brief (GMAC_ISR) Receive Complete */
#define GMAC_ISR_RXUBR               ( 0x1u << 2 )  /**< \brief (GMAC_ISR) RX Used Bit Read */
#define GMAC_ISR_TXUBR               ( 0x1u << 3 )  /**< \brief (GMAC_ISR) TX Used Bit Read */
#define GMAC_ISR_TUR                 ( 0x1u << 4 )  /**< \brief (GMAC_ISR) Transmit Under Run */
#define GMAC_ISR_RLEX                ( 0x1u << 5 )  /**< \brief (GMAC_ISR) Retry Limit Exceeded */
#define GMAC_ISR_TFC                 ( 0x1u << 6 )  /**< \brief (GMAC_ISR) Transmit Frame Corruption due to AHB error */
#define GMAC_ISR_TCOMP               ( 0x1u << 7 )  /**< \brief (GMAC_ISR) Transmit Complete */
#define GMAC_ISR_ROVR                ( 0x1u << 10 ) /**< \brief (GMAC_ISR) Receive Overrun */
#define GMAC_ISR_HRESP               ( 0x1u << 11 ) /**< \brief (GMAC_ISR) HRESP Not OK */
#define GMAC_ISR_PFNZ                ( 0x1u << 12 ) /**< \brief (GMAC_ISR) Pause Frame with Non-zero Pause Quantum Received */
#define GMAC_ISR_PTZ                 ( 0x1u << 13 ) /**< \brief (GMAC_ISR) Pause Time Zero */
#define GMAC_ISR_PFTR                ( 0x1u << 14 ) /**< \brief (GMAC_ISR) Pause Frame Transmitted */
#define GMAC_ISR_DRQFR               ( 0x1u << 18 ) /**< \brief (GMAC_ISR) PTP Delay Request Frame Received */
#define GMAC_ISR_SFR                 ( 0x1u << 19 ) /**< \brief (GMAC_ISR) PTP Sync Frame Received */
#define GMAC_ISR_DRQFT               ( 0x1u << 20 ) /**< \brief (GMAC_ISR) PTP Delay Request Frame Transmitted */
#define GMAC_ISR_SFT                 ( 0x1u << 21 ) /**< \brief (GMAC_ISR) PTP Sync Frame Transmitted */
#define GMAC_ISR_PDRQFR              ( 0x1u << 22 ) /**< \brief (GMAC_ISR) PDelay Request Frame Received */
#define GMAC_ISR_PDRSFR              ( 0x1u << 23 ) /**< \brief (GMAC_ISR) PDelay Response Frame Received */
#define GMAC_ISR_PDRQFT              ( 0x1u << 24 ) /**< \brief (GMAC_ISR) PDelay Request Frame Transmitted */
#define GMAC_ISR_PDRSFT              ( 0x1u << 25 ) /**< \brief (GMAC_ISR) PDelay Response Frame Transmitted */
#define GMAC_ISR_SRI                 ( 0x1u << 26 ) /**< \brief (GMAC_ISR) TSU Seconds Register Increment */
#define GMAC_ISR_WOL                 ( 0x1u << 28 ) /**< \brief (GMAC_ISR) Wake On LAN */
/* -------- GMAC_IER : (GMAC Offset: 0x028) Interrupt Enable Register -------- */
#define GMAC_IER_MFS                 ( 0x1u << 0 )  /**< \brief (GMAC_IER) Management Frame Sent */
#define GMAC_IER_RCOMP               ( 0x1u << 1 )  /**< \brief (GMAC_IER) Receive Complete */
#define GMAC_IER_RXUBR               ( 0x1u << 2 )  /**< \brief (GMAC_IER) RX Used Bit Read */
#define GMAC_IER_TXUBR               ( 0x1u << 3 )  /**< \brief (GMAC_IER) TX Used Bit Read */
#define GMAC_IER_TUR                 ( 0x1u << 4 )  /**< \brief (GMAC_IER) Transmit Under Run */
#define GMAC_IER_RLEX                ( 0x1u << 5 )  /**< \brief (GMAC_IER) Retry Limit Exceeded or Late Collision */
#define GMAC_IER_TFC                 ( 0x1u << 6 )  /**< \brief (GMAC_IER) Transmit Frame Corruption due to AHB error */
#define GMAC_IER_TCOMP               ( 0x1u << 7 )  /**< \brief (GMAC_IER) Transmit Complete */
#define GMAC_IER_ROVR                ( 0x1u << 10 ) /**< \brief (GMAC_IER) Receive Overrun */
#define GMAC_IER_HRESP               ( 0x1u << 11 ) /**< \brief (GMAC_IER) HRESP Not OK */
#define GMAC_IER_PFNZ                ( 0x1u << 12 ) /**< \brief (GMAC_IER) Pause Frame with Non-zero Pause Quantum Received */
#define GMAC_IER_PTZ                 ( 0x1u << 13 ) /**< \brief (GMAC_IER) Pause Time Zero */
#define GMAC_IER_PFTR                ( 0x1u << 14 ) /**< \brief (GMAC_IER) Pause Frame Transmitted */
#define GMAC_IER_EXINT               ( 0x1u << 15 ) /**< \brief (GMAC_IER) External Interrupt */
#define GMAC_IER_DRQFR               ( 0x1u << 18 ) /**< \brief (GMAC_IER) PTP Delay Request Frame Received */
#define GMAC_IER_SFR                 ( 0x1u << 19 ) /**< \brief (GMAC_IER) PTP Sync Frame Received */
#define GMAC_IER_DRQFT               ( 0x1u << 20 ) /**< \brief (GMAC_IER) PTP Delay Request Frame Transmitted */
#define GMAC_IER_SFT                 ( 0x1u << 21 ) /**< \brief (GMAC_IER) PTP Sync Frame Transmitted */
#define GMAC_IER_PDRQFR              ( 0x1u << 22 ) /**< \brief (GMAC_IER) PDelay Request Frame Received */
#define GMAC_IER_PDRSFR              ( 0x1u << 23 ) /**< \brief (GMAC_IER) PDelay Response Frame Received */
#define GMAC_IER_PDRQFT              ( 0x1u << 24 ) /**< \brief (GMAC_IER) PDelay Request Frame Transmitted */
#define GMAC_IER_PDRSFT              ( 0x1u << 25 ) /**< \brief (GMAC_IER) PDelay Response Frame Transmitted */
#define GMAC_IER_SRI                 ( 0x1u << 26 ) /**< \brief (GMAC_IER) TSU Seconds Register Increment */
#define GMAC_IER_WOL                 ( 0x1u << 28 ) /**< \brief (GMAC_IER) Wake On LAN */
/* -------- GMAC_IDR : (GMAC Offset: 0x02C) Interrupt Disable Register -------- */
#define GMAC_IDR_MFS                 ( 0x1u << 0 )  /**< \brief (GMAC_IDR) Management Frame Sent */
#define GMAC_IDR_RCOMP               ( 0x1u << 1 )  /**< \brief (GMAC_IDR) Receive Complete */
#define GMAC_IDR_RXUBR               ( 0x1u << 2 )  /**< \brief (GMAC_IDR) RX Used Bit Read */
#define GMAC_IDR_TXUBR               ( 0x1u << 3 )  /**< \brief (GMAC_IDR) TX Used Bit Read */
#define GMAC_IDR_TUR                 ( 0x1u << 4 )  /**< \brief (GMAC_IDR) Transmit Under Run */
#define GMAC_IDR_RLEX                ( 0x1u << 5 )  /**< \brief (GMAC_IDR) Retry Limit Exceeded or Late Collision */
#define GMAC_IDR_TFC                 ( 0x1u << 6 )  /**< \brief (GMAC_IDR) Transmit Frame Corruption due to AHB error */
#define GMAC_IDR_TCOMP               ( 0x1u << 7 )  /**< \brief (GMAC_IDR) Transmit Complete */
#define GMAC_IDR_ROVR                ( 0x1u << 10 ) /**< \brief (GMAC_IDR) Receive Overrun */
#define GMAC_IDR_HRESP               ( 0x1u << 11 ) /**< \brief (GMAC_IDR) HRESP Not OK */
#define GMAC_IDR_PFNZ                ( 0x1u << 12 ) /**< \brief (GMAC_IDR) Pause Frame with Non-zero Pause Quantum Received */
#define GMAC_IDR_PTZ                 ( 0x1u << 13 ) /**< \brief (GMAC_IDR) Pause Time Zero */
#define GMAC_IDR_PFTR                ( 0x1u << 14 ) /**< \brief (GMAC_IDR) Pause Frame Transmitted */
#define GMAC_IDR_EXINT               ( 0x1u << 15 ) /**< \brief (GMAC_IDR) External Interrupt */
#define GMAC_IDR_DRQFR               ( 0x1u << 18 ) /**< \brief (GMAC_IDR) PTP Delay Request Frame Received */
#define GMAC_IDR_SFR                 ( 0x1u << 19 ) /**< \brief (GMAC_IDR) PTP Sync Frame Received */
#define GMAC_IDR_DRQFT               ( 0x1u << 20 ) /**< \brief (GMAC_IDR) PTP Delay Request Frame Transmitted */
#define GMAC_IDR_SFT                 ( 0x1u << 21 ) /**< \brief (GMAC_IDR) PTP Sync Frame Transmitted */
#define GMAC_IDR_PDRQFR              ( 0x1u << 22 ) /**< \brief (GMAC_IDR) PDelay Request Frame Received */
#define GMAC_IDR_PDRSFR              ( 0x1u << 23 ) /**< \brief (GMAC_IDR) PDelay Response Frame Received */
#define GMAC_IDR_PDRQFT              ( 0x1u << 24 ) /**< \brief (GMAC_IDR) PDelay Request Frame Transmitted */
#define GMAC_IDR_PDRSFT              ( 0x1u << 25 ) /**< \brief (GMAC_IDR) PDelay Response Frame Transmitted */
#define GMAC_IDR_SRI                 ( 0x1u << 26 ) /**< \brief (GMAC_IDR) TSU Seconds Register Increment */
#define GMAC_IDR_WOL                 ( 0x1u << 28 ) /**< \brief (GMAC_IDR) Wake On LAN */
/* -------- GMAC_IMR : (GMAC Offset: 0x030) Interrupt Mask Register -------- */
#define GMAC_IMR_MFS                 ( 0x1u << 0 )  /**< \brief (GMAC_IMR) Management Frame Sent */
#define GMAC_IMR_RCOMP               ( 0x1u << 1 )  /**< \brief (GMAC_IMR) Receive Complete */
#define GMAC_IMR_RXUBR               ( 0x1u << 2 )  /**< \brief (GMAC_IMR) RX Used Bit Read */
#define GMAC_IMR_TXUBR               ( 0x1u << 3 )  /**< \brief (GMAC_IMR) TX Used Bit Read */
#define GMAC_IMR_TUR                 ( 0x1u << 4 )  /**< \brief (GMAC_IMR) Transmit Under Run */
#define GMAC_IMR_RLEX                ( 0x1u << 5 )  /**< \brief (GMAC_IMR) Retry Limit Exceeded */
#define GMAC_IMR_TFC                 ( 0x1u << 6 )  /**< \brief (GMAC_IMR) Transmit Frame Corruption due to AHB error */
#define GMAC_IMR_TCOMP               ( 0x1u << 7 )  /**< \brief (GMAC_IMR) Transmit Complete */
#define GMAC_IMR_ROVR                ( 0x1u << 10 ) /**< \brief (GMAC_IMR) Receive Overrun */
#define GMAC_IMR_HRESP               ( 0x1u << 11 ) /**< \brief (GMAC_IMR) HRESP Not OK */
#define GMAC_IMR_PFNZ                ( 0x1u << 12 ) /**< \brief (GMAC_IMR) Pause Frame with Non-zero Pause Quantum Received */
#define GMAC_IMR_PTZ                 ( 0x1u << 13 ) /**< \brief (GMAC_IMR) Pause Time Zero */
#define GMAC_IMR_PFTR                ( 0x1u << 14 ) /**< \brief (GMAC_IMR) Pause Frame Transmitted */
#define GMAC_IMR_EXINT               ( 0x1u << 15 ) /**< \brief (GMAC_IMR) External Interrupt */
#define GMAC_IMR_DRQFR               ( 0x1u << 18 ) /**< \brief (GMAC_IMR) PTP Delay Request Frame Received */
#define GMAC_IMR_SFR                 ( 0x1u << 19 ) /**< \brief (GMAC_IMR) PTP Sync Frame Received */
#define GMAC_IMR_DRQFT               ( 0x1u << 20 ) /**< \brief (GMAC_IMR) PTP Delay Request Frame Transmitted */
#define GMAC_IMR_SFT                 ( 0x1u << 21 ) /**< \brief (GMAC_IMR) PTP Sync Frame Transmitted */
#define GMAC_IMR_PDRQFR              ( 0x1u << 22 ) /**< \brief (GMAC_IMR) PDelay Request Frame Received */
#define GMAC_IMR_PDRSFR              ( 0x1u << 23 ) /**< \brief (GMAC_IMR) PDelay Response Frame Received */
#define GMAC_IMR_PDRQFT              ( 0x1u << 24 ) /**< \brief (GMAC_IMR) PDelay Request Frame Transmitted */
#define GMAC_IMR_PDRSFT              ( 0x1u << 25 ) /**< \brief (GMAC_IMR) PDelay Response Frame Transmitted */
/* -------- GMAC_MAN : (GMAC Offset: 0x034) PHY Maintenance Register -------- */
#define GMAC_MAN_DATA_Pos            0
#define GMAC_MAN_DATA_Msk            ( 0xffffu << GMAC_MAN_DATA_Pos ) /**< \brief (GMAC_MAN) PHY Data */
#define GMAC_MAN_DATA( value )    ( ( GMAC_MAN_DATA_Msk & ( ( value ) << GMAC_MAN_DATA_Pos ) ) )
#define GMAC_MAN_WTN_Pos             16
#define GMAC_MAN_WTN_Msk             ( 0x3u << GMAC_MAN_WTN_Pos ) /**< \brief (GMAC_MAN) Write Ten */
#define GMAC_MAN_WTN( value )     ( ( GMAC_MAN_WTN_Msk & ( ( value ) << GMAC_MAN_WTN_Pos ) ) )
#define GMAC_MAN_REGA_Pos            18
#define GMAC_MAN_REGA_Msk            ( 0x1fu << GMAC_MAN_REGA_Pos ) /**< \brief (GMAC_MAN) Register Address */
#define GMAC_MAN_REGA( value )    ( ( GMAC_MAN_REGA_Msk & ( ( value ) << GMAC_MAN_REGA_Pos ) ) )
#define GMAC_MAN_PHYA_Pos            23
#define GMAC_MAN_PHYA_Msk            ( 0x1fu << GMAC_MAN_PHYA_Pos ) /**< \brief (GMAC_MAN) PHY Address */
#define GMAC_MAN_PHYA( value )    ( ( GMAC_MAN_PHYA_Msk & ( ( value ) << GMAC_MAN_PHYA_Pos ) ) )
#define GMAC_MAN_OP_Pos              28
#define GMAC_MAN_OP_Msk              ( 0x3u << GMAC_MAN_OP_Pos ) /**< \brief (GMAC_MAN) Operation */
#define GMAC_MAN_OP( value )      ( ( GMAC_MAN_OP_Msk & ( ( value ) << GMAC_MAN_OP_Pos ) ) )
#define GMAC_MAN_CLTTO               ( 0x1u << 30 )              /**< \brief (GMAC_MAN) Clause 22 Operation */
#define GMAC_MAN_WZO                 ( 0x1u << 31 )              /**< \brief (GMAC_MAN) Write ZERO */
/* -------- GMAC_RPQ : (GMAC Offset: 0x038) Received Pause Quantum Register -------- */
#define GMAC_RPQ_RPQ_Pos             0
#define GMAC_RPQ_RPQ_Msk             ( 0xffffu << GMAC_RPQ_RPQ_Pos ) /**< \brief (GMAC_RPQ) Received Pause Quantum */
/* -------- GMAC_TPQ : (GMAC Offset: 0x03C) Transmit Pause Quantum Register -------- */
#define GMAC_TPQ_TPQ_Pos             0
#define GMAC_TPQ_TPQ_Msk             ( 0xffffu << GMAC_TPQ_TPQ_Pos ) /**< \brief (GMAC_TPQ) Transmit Pause Quantum */
#define GMAC_TPQ_TPQ( value )    ( ( GMAC_TPQ_TPQ_Msk & ( ( value ) << GMAC_TPQ_TPQ_Pos ) ) )
/* -------- GMAC_HRB : (GMAC Offset: 0x080) Hash Register Bottom [31:0] -------- */
#define GMAC_HRB_ADDR_Pos            0
#define GMAC_HRB_ADDR_Msk            ( 0xffffffffu << GMAC_HRB_ADDR_Pos ) /**< \brief (GMAC_HRB) Hash Address */
#define GMAC_HRB_ADDR( value )    ( ( GMAC_HRB_ADDR_Msk & ( ( value ) << GMAC_HRB_ADDR_Pos ) ) )
/* -------- GMAC_HRT : (GMAC Offset: 0x084) Hash Register Top [63:32] -------- */
#define GMAC_HRT_ADDR_Pos            0
#define GMAC_HRT_ADDR_Msk            ( 0xffffffffu << GMAC_HRT_ADDR_Pos ) /**< \brief (GMAC_HRT) Hash Address */
#define GMAC_HRT_ADDR( value )    ( ( GMAC_HRT_ADDR_Msk & ( ( value ) << GMAC_HRT_ADDR_Pos ) ) )
/* -------- GMAC_SAB1 : (GMAC Offset: 0x088) Specific Address 1 Bottom [31:0] Register -------- */
#define GMAC_SAB1_ADDR_Pos           0
#define GMAC_SAB1_ADDR_Msk           ( 0xffffffffu << GMAC_SAB1_ADDR_Pos ) /**< \brief (GMAC_SAB1) Specific Address 1 */
#define GMAC_SAB1_ADDR( value )    ( ( GMAC_SAB1_ADDR_Msk & ( ( value ) << GMAC_SAB1_ADDR_Pos ) ) )
/* -------- GMAC_SAT1 : (GMAC Offset: 0x08C) Specific Address 1 Top [47:32] Register -------- */
#define GMAC_SAT1_ADDR_Pos           0
#define GMAC_SAT1_ADDR_Msk           ( 0xffffu << GMAC_SAT1_ADDR_Pos ) /**< \brief (GMAC_SAT1) Specific Address 1 */
#define GMAC_SAT1_ADDR( value )    ( ( GMAC_SAT1_ADDR_Msk & ( ( value ) << GMAC_SAT1_ADDR_Pos ) ) )
/* -------- GMAC_SAB2 : (GMAC Offset: 0x090) Specific Address 2 Bottom [31:0] Register -------- */
#define GMAC_SAB2_ADDR_Pos           0
#define GMAC_SAB2_ADDR_Msk           ( 0xffffffffu << GMAC_SAB2_ADDR_Pos ) /**< \brief (GMAC_SAB2) Specific Address 2 */
#define GMAC_SAB2_ADDR( value )    ( ( GMAC_SAB2_ADDR_Msk & ( ( value ) << GMAC_SAB2_ADDR_Pos ) ) )
/* -------- GMAC_SAT2 : (GMAC Offset: 0x094) Specific Address 2 Top [47:32] Register -------- */
#define GMAC_SAT2_ADDR_Pos           0
#define GMAC_SAT2_ADDR_Msk           ( 0xffffu << GMAC_SAT2_ADDR_Pos ) /**< \brief (GMAC_SAT2) Specific Address 2 */
#define GMAC_SAT2_ADDR( value )    ( ( GMAC_SAT2_ADDR_Msk & ( ( value ) << GMAC_SAT2_ADDR_Pos ) ) )
/* -------- GMAC_SAB3 : (GMAC Offset: 0x098) Specific Address 3 Bottom [31:0] Register -------- */
#define GMAC_SAB3_ADDR_Pos           0
#define GMAC_SAB3_ADDR_Msk           ( 0xffffffffu << GMAC_SAB3_ADDR_Pos ) /**< \brief (GMAC_SAB3) Specific Address 3 */
#define GMAC_SAB3_ADDR( value )    ( ( GMAC_SAB3_ADDR_Msk & ( ( value ) << GMAC_SAB3_ADDR_Pos ) ) )
/* -------- GMAC_SAT3 : (GMAC Offset: 0x09C) Specific Address 3 Top [47:32] Register -------- */
#define GMAC_SAT3_ADDR_Pos           0
#define GMAC_SAT3_ADDR_Msk           ( 0xffffu << GMAC_SAT3_ADDR_Pos ) /**< \brief (GMAC_SAT3) Specific Address 3 */
#define GMAC_SAT3_ADDR( value )    ( ( GMAC_SAT3_ADDR_Msk & ( ( value ) << GMAC_SAT3_ADDR_Pos ) ) )
/* -------- GMAC_SAB4 : (GMAC Offset: 0x0A0) Specific Address 4 Bottom [31:0] Register -------- */
#define GMAC_SAB4_ADDR_Pos           0
#define GMAC_SAB4_ADDR_Msk           ( 0xffffffffu << GMAC_SAB4_ADDR_Pos ) /**< \brief (GMAC_SAB4) Specific Address 4 */
#define GMAC_SAB4_ADDR( value )    ( ( GMAC_SAB4_ADDR_Msk & ( ( value ) << GMAC_SAB4_ADDR_Pos ) ) )
/* -------- GMAC_SAT4 : (GMAC Offset: 0x0A4) Specific Address 4 Top [47:32] Register -------- */
#define GMAC_SAT4_ADDR_Pos           0
#define GMAC_SAT4_ADDR_Msk           ( 0xffffu << GMAC_SAT4_ADDR_Pos ) /**< \brief (GMAC_SAT4) Specific Address 4 */
#define GMAC_SAT4_ADDR( value )    ( ( GMAC_SAT4_ADDR_Msk & ( ( value ) << GMAC_SAT4_ADDR_Pos ) ) )
/* -------- GMAC_TIDM[4] : (GMAC Offset: 0x0A8) Type ID Match 1 Register -------- */
#define GMAC_TIDM_TID_Pos            0
#define GMAC_TIDM_TID_Msk            ( 0xffffu << GMAC_TIDM_TID_Pos ) /**< \brief (GMAC_TIDM[4]) Type ID Match 1 */
#define GMAC_TIDM_TID( value )    ( ( GMAC_TIDM_TID_Msk & ( ( value ) << GMAC_TIDM_TID_Pos ) ) )
/* -------- GMAC_WOL : (GMAC Offset: 0x0B8) Wake on LAN Register -------- */
#define GMAC_WOL_IP_Pos              0
#define GMAC_WOL_IP_Msk              ( 0xffffu << GMAC_WOL_IP_Pos ) /**< \brief (GMAC_WOL) ARP Request IP Address */
#define GMAC_WOL_IP( value )    ( ( GMAC_WOL_IP_Msk & ( ( value ) << GMAC_WOL_IP_Pos ) ) )
#define GMAC_WOL_MAG                 ( 0x1u << 16 )                 /**< \brief (GMAC_WOL) Magic Packet Event Enable */
#define GMAC_WOL_ARP                 ( 0x1u << 17 )                 /**< \brief (GMAC_WOL) ARP Request IP Address */
#define GMAC_WOL_SA1                 ( 0x1u << 18 )                 /**< \brief (GMAC_WOL) Specific Address Register 1 Event Enable */
#define GMAC_WOL_MTI                 ( 0x1u << 19 )                 /**< \brief (GMAC_WOL) Multicast Hash Event Enable */
/* -------- GMAC_IPGS : (GMAC Offset: 0x0BC) IPG Stretch Register -------- */
#define GMAC_IPGS_FL_Pos             0
#define GMAC_IPGS_FL_Msk             ( 0xffffu << GMAC_IPGS_FL_Pos ) /**< \brief (GMAC_IPGS) Frame Length */
#define GMAC_IPGS_FL( value )    ( ( GMAC_IPGS_FL_Msk & ( ( value ) << GMAC_IPGS_FL_Pos ) ) )
/* -------- GMAC_SVLAN : (GMAC Offset: 0x0C0) Stacked VLAN Register -------- */
#define GMAC_SVLAN_VLAN_TYPE_Pos     0
#define GMAC_SVLAN_VLAN_TYPE_Msk     ( 0xffffu << GMAC_SVLAN_VLAN_TYPE_Pos ) /**< \brief (GMAC_SVLAN) User Defined VLAN_TYPE Field */
#define GMAC_SVLAN_VLAN_TYPE( value )    ( ( GMAC_SVLAN_VLAN_TYPE_Msk & ( ( value ) << GMAC_SVLAN_VLAN_TYPE_Pos ) ) )
#define GMAC_SVLAN_ESVLAN            ( 0x1u << 31 )                          /**< \brief (GMAC_SVLAN) Enable Stacked VLAN Processing Mode */
/* -------- GMAC_TPFCP : (GMAC Offset: 0x0C4) Transmit PFC Pause Register -------- */
#define GMAC_TPFCP_PEV_Pos           0
#define GMAC_TPFCP_PEV_Msk           ( 0xffu << GMAC_TPFCP_PEV_Pos ) /**< \brief (GMAC_TPFCP) Priority Enable Vector */
#define GMAC_TPFCP_PEV( value )    ( ( GMAC_TPFCP_PEV_Msk & ( ( value ) << GMAC_TPFCP_PEV_Pos ) ) )
#define GMAC_TPFCP_PQ_Pos            8
#define GMAC_TPFCP_PQ_Msk            ( 0xffu << GMAC_TPFCP_PQ_Pos ) /**< \brief (GMAC_TPFCP) Pause Quantum */
#define GMAC_TPFCP_PQ( value )     ( ( GMAC_TPFCP_PQ_Msk & ( ( value ) << GMAC_TPFCP_PQ_Pos ) ) )
/* -------- GMAC_SAMB1 : (GMAC Offset: 0x0C8) Specific Address 1 Mask Bottom [31:0] Register -------- */
#define GMAC_SAMB1_ADDR_Pos          0
#define GMAC_SAMB1_ADDR_Msk          ( 0xffffffffu << GMAC_SAMB1_ADDR_Pos ) /**< \brief (GMAC_SAMB1) Specific Address 1 Mask */
#define GMAC_SAMB1_ADDR( value )    ( ( GMAC_SAMB1_ADDR_Msk & ( ( value ) << GMAC_SAMB1_ADDR_Pos ) ) )
/* -------- GMAC_SAMT1 : (GMAC Offset: 0x0CC) Specific Address 1 Mask Top [47:32] Register -------- */
#define GMAC_SAMT1_ADDR_Pos          0
#define GMAC_SAMT1_ADDR_Msk          ( 0xffffu << GMAC_SAMT1_ADDR_Pos ) /**< \brief (GMAC_SAMT1) Specific Address 1 Mask */
#define GMAC_SAMT1_ADDR( value )    ( ( GMAC_SAMT1_ADDR_Msk & ( ( value ) << GMAC_SAMT1_ADDR_Pos ) ) )
/* -------- GMAC_MID : (GMAC Offset: 0x0FC) Module ID Register -------- */
#define GMAC_MID_MREV_Pos            0
#define GMAC_MID_MREV_Msk            ( 0xffffu << GMAC_MID_MREV_Pos ) /**< \brief (GMAC_MID) Module Revision */
#define GMAC_MID_MID_Pos             16
#define GMAC_MID_MID_Msk             ( 0xffffu << GMAC_MID_MID_Pos )  /**< \brief (GMAC_MID) Module Identification Number */
/* -------- GMAC_OTLO : (GMAC Offset: 0x100) Octets Transmitted [31:0] Register -------- */
#define GMAC_OTLO_TXO_Pos            0
#define GMAC_OTLO_TXO_Msk            ( 0xffffffffu << GMAC_OTLO_TXO_Pos ) /**< \brief (GMAC_OTLO) Transmitted Octets */
/* -------- GMAC_OTHI : (GMAC Offset: 0x104) Octets Transmitted [47:32] Register -------- */
#define GMAC_OTHI_TXO_Pos            0
#define GMAC_OTHI_TXO_Msk            ( 0xffffu << GMAC_OTHI_TXO_Pos ) /**< \brief (GMAC_OTHI) Transmitted Octets */
/* -------- GMAC_FT : (GMAC Offset: 0x108) Frames Transmitted Register -------- */
#define GMAC_FT_FTX_Pos              0
#define GMAC_FT_FTX_Msk              ( 0xffffffffu << GMAC_FT_FTX_Pos ) /**< \brief (GMAC_FT) Frames Transmitted without Error */
/* -------- GMAC_BCFT : (GMAC Offset: 0x10C) Broadcast Frames Transmitted Register -------- */
#define GMAC_BCFT_BFTX_Pos           0
#define GMAC_BCFT_BFTX_Msk           ( 0xffffffffu << GMAC_BCFT_BFTX_Pos ) /**< \brief (GMAC_BCFT) Broadcast Frames Transmitted without Error */
/* -------- GMAC_MFT : (GMAC Offset: 0x110) Multicast Frames Transmitted Register -------- */
#define GMAC_MFT_MFTX_Pos            0
#define GMAC_MFT_MFTX_Msk            ( 0xffffffffu << GMAC_MFT_MFTX_Pos ) /**< \brief (GMAC_MFT) Multicast Frames Transmitted without Error */
/* -------- GMAC_PFT : (GMAC Offset: 0x114) Pause Frames Transmitted Register -------- */
#define GMAC_PFT_PFTX_Pos            0
#define GMAC_PFT_PFTX_Msk            ( 0xffffu << GMAC_PFT_PFTX_Pos ) /**< \brief (GMAC_PFT) Pause Frames Transmitted Register */
/* -------- GMAC_BFT64 : (GMAC Offset: 0x118) 64 Byte Frames Transmitted Register -------- */
#define GMAC_BFT64_NFTX_Pos          0
#define GMAC_BFT64_NFTX_Msk          ( 0xffffffffu << GMAC_BFT64_NFTX_Pos ) /**< \brief (GMAC_BFT64) 64 Byte Frames Transmitted without Error */
/* -------- GMAC_TBFT127 : (GMAC Offset: 0x11C) 65 to 127 Byte Frames Transmitted Register -------- */
#define GMAC_TBFT127_NFTX_Pos        0
#define GMAC_TBFT127_NFTX_Msk        ( 0xffffffffu << GMAC_TBFT127_NFTX_Pos ) /**< \brief (GMAC_TBFT127) 65 to 127 Byte Frames Transmitted without Error */
/* -------- GMAC_TBFT255 : (GMAC Offset: 0x120) 128 to 255 Byte Frames Transmitted Register -------- */
#define GMAC_TBFT255_NFTX_Pos        0
#define GMAC_TBFT255_NFTX_Msk        ( 0xffffffffu << GMAC_TBFT255_NFTX_Pos ) /**< \brief (GMAC_TBFT255) 128 to 255 Byte Frames Transmitted without Error */
/* -------- GMAC_TBFT511 : (GMAC Offset: 0x124) 256 to 511 Byte Frames Transmitted Register -------- */
#define GMAC_TBFT511_NFTX_Pos        0
#define GMAC_TBFT511_NFTX_Msk        ( 0xffffffffu << GMAC_TBFT511_NFTX_Pos ) /**< \brief (GMAC_TBFT511) 256 to 511 Byte Frames Transmitted without Error */
/* -------- GMAC_TBFT1023 : (GMAC Offset: 0x128) 512 to 1023 Byte Frames Transmitted Register -------- */
#define GMAC_TBFT1023_NFTX_Pos       0
#define GMAC_TBFT1023_NFTX_Msk       ( 0xffffffffu << GMAC_TBFT1023_NFTX_Pos ) /**< \brief (GMAC_TBFT1023) 512 to 1023 Byte Frames Transmitted without Error */
/* -------- GMAC_TBFT1518 : (GMAC Offset: 0x12C) 1024 to 1518 Byte Frames Transmitted Register -------- */
#define GMAC_TBFT1518_NFTX_Pos       0
#define GMAC_TBFT1518_NFTX_Msk       ( 0xffffffffu << GMAC_TBFT1518_NFTX_Pos ) /**< \brief (GMAC_TBFT1518) 1024 to 1518 Byte Frames Transmitted without Error */
/* -------- GMAC_GTBFT1518 : (GMAC Offset: 0x130) Greater Than 1518 Byte Frames Transmitted Register -------- */
#define GMAC_GTBFT1518_NFTX_Pos      0
#define GMAC_GTBFT1518_NFTX_Msk      ( 0xffffffffu << GMAC_GTBFT1518_NFTX_Pos ) /**< \brief (GMAC_GTBFT1518) Greater than 1518 Byte Frames Transmitted without Error */
/* -------- GMAC_TUR : (GMAC Offset: 0x134) Transmit Under Runs Register -------- */
#define GMAC_TUR_TXUNR_Pos           0
#define GMAC_TUR_TXUNR_Msk           ( 0x3ffu << GMAC_TUR_TXUNR_Pos ) /**< \brief (GMAC_TUR) Transmit Under Runs */
/* -------- GMAC_SCF : (GMAC Offset: 0x138) Single Collision Frames Register -------- */
#define GMAC_SCF_SCOL_Pos            0
#define GMAC_SCF_SCOL_Msk            ( 0x3ffffu << GMAC_SCF_SCOL_Pos ) /**< \brief (GMAC_SCF) Single Collision */
/* -------- GMAC_MCF : (GMAC Offset: 0x13C) Multiple Collision Frames Register -------- */
#define GMAC_MCF_MCOL_Pos            0
#define GMAC_MCF_MCOL_Msk            ( 0x3ffffu << GMAC_MCF_MCOL_Pos ) /**< \brief (GMAC_MCF) Multiple Collision */
